20240213T094738--kdoc-93-access-control-allow-headersを調べた__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-15 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 93: Access-Control-Allow-Headersを調べた</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 93: Access-Control-Allow-Headersを調べた</h1>

<div id="outline-container-org1977685" class="outline-2">
<h2 id="org1977685"><a href="#org1977685">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org1977685">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-15 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-02-18 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgb75800e" class="outline-2">
<h2 id="orgb75800e"><a href="#orgb75800e">概要</a></h2>
<div class="outline-text-2" id="text-orgb75800e">
<p>
POSTリクエストは成功するのに、GETリクエストがCORSエラーな状態になった。デベロッパーツールを見るとCORSエラーが出ていた。真の違いの理由は、トークンでAuthorizationヘッダーを使っていたことだった。調べて <code>Access-Control-Allow-Headers</code> を返すようにしたら解決したが、知らなかったので調べる。
</p>
</div>
</div>

<div id="outline-container-orgc4eca8a" class="outline-2">
<h2 id="orgc4eca8a"><a href="#orgc4eca8a">何か</a></h2>
<div class="outline-text-2" id="text-orgc4eca8a">
<p>
Access-Control-Allow-Headersは、同一オリジンでないときに、実際のリクエスト(プリフライトリクエストと対置して)で使用できるヘッダーの種類を示すものだ。デフォルトではAccept, Accept-Language, Content-Language, Content-Typeだけが許可されていて、Authorizationヘッダーは含まれていない。
</p>

<p>
Google Chromeの挙動を見る限り、同一オリジンでないときに許可してないヘッダーが含まれていた場合は、問答無用でCORSエラーになる。
</p>
</div>
</div>

<div id="outline-container-org521e62f" class="outline-2">
<h2 id="org521e62f"><a href="#org521e62f">流れ</a></h2>
<div class="outline-text-2" id="text-org521e62f">
<p>
プリフライトリクエストから一連の流れを見る。まず、ブラウザは実際のリクエスト前にOriginヘッダーが同一でないのを見て、CORSによってリソースに<a href="20210509100112-javascript.html#ID-a6980e15-ecee-466e-9ea7-2c0210243c0d">JavaScript</a>コードがアクセスできるか判断しようとする。検証するため、ブラウザは実際に行いたいリクエストを元にプリフライトリクエストを作成する。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>プリフライトリクエストのイメージ</label><pre class="src src-shell">curl -v <span class="org-sh-escaped-newline">\</span>
     -H <span class="org-string">"Origin: nandemoii.com"</span> <span class="org-sh-escaped-newline">\</span>
     -H <span class="org-string">"Access-Control-Request-Method: GET"</span> <span class="org-string">\ </span>&#128072;
     -H <span class="org-string">"Access-Control-Request-Headers: Authorization"</span> <span class="org-string">\ </span>&#128072;
     -H <span class="org-string">"Content-Type: application/json"</span> <span class="org-sh-escaped-newline">\</span>
     -X OPTIONS <span class="org-sh-escaped-newline">\</span>
     <span class="org-string">'http://localhost/manage/manage/projects'</span>
</pre>
</div>

<ul class="org-ul">
<li>実際に行いたいリクエストのメソッドは Access-Control-Request-Method で表現する</li>
<li>実際に行いたいリクエストのヘッダーは Access-Control-Allow-Headers で表現する</li>
<li>プリフライトリクエスト自体はOPTIONSメソッド</li>
</ul>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>プリフライトリクエストに対するレスポンスヘッダー</label><pre class="src src-shell">&lt; HTTP/1.1 200 OK
&lt; Date: Thu, 15 Feb 2024 13:19:49 GMT
&lt; Server: Apache
&lt; access-control-allow-origin: *
&lt; Content-Length: 0
&lt; Content-Type: text/html; <span class="org-variable-name">charset</span>=UTF-8
&lt; Cache-Control: max-age=1
&lt; Expires: Thu, 15 Feb 2024 13:19:50 GMT
&lt; Access-Control-Allow-Methods: POST, GET, OPTIONS, PUT, DELETE &#128072;
&lt; Access-Control-Allow-Headers: Authorization &#128072;
&lt;
</pre>
</div>

<p>
↑ここで、Webサーバはリソースの共有方針をブラウザに教える。Webサーバは、5つのリクエストメソッドを許可し、リクエストヘッダーはAuthorizationを許可している。ここで、プリフライトリクエストに含まれていた使用予定のメソッド、ヘッダーがすべて含まれていることがわかる。これによって、Javascriptがリソースにアクセスできる権限が確認できたことになる。
</p>

<p>
確認ののち、本番のリクエストを行う。
</p>

<div class="org-src-container">
<pre class="src src-shell">curl -v <span class="org-sh-escaped-newline">\</span>
     -H <span class="org-string">"Origin: nandemoii.com"</span> <span class="org-sh-escaped-newline">\</span>
     -H <span class="org-string">"Content-Type: application/json"</span> <span class="org-sh-escaped-newline">\</span>
     -H <span class="org-string">"Authorization: Bearer xxxx"</span> <span class="org-sh-escaped-newline">\</span>
     <span class="org-string">'http://localhost/manage/manage/projects'</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>↑のレスポンスヘッダー</label><pre class="src src-shell">&lt; HTTP/1.1 200 OK
&lt; Date: Thu, 15 Feb 2024 13:23:15 GMT
&lt; Server: Apache
&lt; Content-Length: 460
&lt; Content-Type: application/json; <span class="org-variable-name">charset</span>=UTF-8
&lt; Vary: Accept-Encoding
&lt; Cache-Control: max-age=1
&lt; Expires: Thu, 15 Feb 2024 13:23:16 GMT
&lt; Access-Control-Allow-Origin: *
&lt; Access-Control-Allow-Methods: POST, GET, OPTIONS, PUT, DELETE
&lt; Access-Control-Allow-Headers: Authorization
</pre>
</div>
</div>
</div>

<div id="outline-container-org1f6e619" class="outline-2">
<h2 id="org1f6e619"><a href="#org1f6e619">参考</a></h2>
<div class="outline-text-2" id="text-org1f6e619">
<ul class="org-ul">
<li><a href="https://developer.mozilla.org/ja/docs/Web/HTTP/Headers/Access-Control-Allow-Headers">Access-Control-Allow-Headers - HTTP | MDN</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1d33d67" class="outline-2">
<h2 id="org1d33d67"><a href="#org1d33d67">関連</a></h2>
<div class="outline-text-2" id="text-org1d33d67">
<ul class="org-ul">
<li><a href="20240209T111023--kdoc-83-corsを確認する__wiki.html#ID-20240209T111023">KDOC 83: CORSを確認する方法</a>。CORSつながり</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
